ServidoresLaravel/tiendalaravel2324/routes/web.php

SELECT * FROM "articulos"
SELECT * FROM "categorias" WHERE "categorias"."id" in (1)
SELECT * FROM "ivas" WHERE "ivas"."id" in (2, 3)
SELECT * FROM "categorias" WHERE "categorias"."id" in (2)
SELECT * FROM "ivas" WHERE "ivas"."id" in (1, 2)
---
|
*/

Route::get('/', function () {
    return view('principal', [
        'articulos' => Articulo::with('iva', 'categoria')->get(),
        'carrito' => Carrito::carrito(),
    ]);
})->name('principal');

Route::get('/principal', function () {
    return view('principal', [
        'articulos' => Articulo::with('iva', 'categoria')->get(),
        'carrito' => Carrito::carrito(),
    ]);