tiendalaravel2324/app/Http/Controllers/ArticuloController.php

    public function index()
    {
        $articulos = Articulo::with(['categoria', 'iva'])->get();
---
SELECT * FROM "categorias" WHERE "categorias"."id" in (2)
SELECT * FROM "ivas" WHERE "ivas"."id" in (2)

    public function create()
    {
        return view('articulos.create', [
            'categorias' => Categoria::all(),
        ]);
---
SELECT * FROM "categorias"