tiendalaravel2324/app/Http/Controllers/CategoriaController.php

    public function index()
    {
        return view('categorias.index'); [
            'categorias' => $categorias = Categoria::all()
        ];
---
SELECT * FROM "categorias"