tiendalaravel2324/app/Generico/Carrito.php

SELECT * FROM "articulos" WHERE "articulos"."id" = '3' LIMIT 1
---
    public function insertar($id)
    {

        if (!($articulo = Articulo::find($id)))