ServidoresLaravel/tiendalaravel2324/app/Http/Controllers/ArticuloController.php

    public function create()
    {
        return view('articulos.create', [
            'categorias' => Categoria::all(),
            'ivas' => Iva::all(),
        ]);
---
SELECT * FROM "ivas"
SELECT * FROM "categorias"

    public function store(Request $request)
    {
        $validated = $this->validar($request);
        Articulo::create($validated);
---
INSERT INTO "articulos" ("denominacion", "precio", "categoria_id", "iva_id", "updated_at", "created_at") VALUES ('Lacasitos', '1.20', '1', '1', '2024-01-16 18:15:16', '2024-01-16 18:15:16') returning "id"

    public function edit(Articulo $articulo)
    {
        return view('articulos.edit', [
            'articulo' => $articulo,
            'categorias' => Categoria::all(),
            'ivas' => Iva::all(),
        ]);
---
SELECT * FROM "categorias"
SELECT * FROM "ivas"

    public function update(Request $request, Articulo $articulo)
    {
        $validated = $this->validar($request);
        $articulo->update($validated);
---
UPDATE "articulos" SET "categoria_id" = '2', "updated_at" = '2024-01-16 18:16:12' WHERE "id" = 1