ServidoresLaravel/tiendalaravel2324/app/Http/Controllers/FacturaController.php

    public function index()
    {
        if (Auth::user()->es_admin()) {
            $facturas = Factura::with('user');
        } else {
            $facturas = Auth::user()->facturas()->with('user');
        }
        $facturas = $facturas
            ->selectRaw('facturas.id, facturas.user_id, facturas.created_at, sum(cantidad * precio) as total')
            ->join('articulo_factura', 'facturas.id', '=', 'articulo_factura.factura_id')
            ->join('articulos', 'articulos.id', '=', 'articulo_factura.articulo_id')
            ->groupBy('facturas.id')
            ->get();
---
SELECT facturas.id, facturas.user_id, facturas.created_at, sum(cantidad * precio) as total FROM "facturas" inner join "articulo_factura" on "facturas"."id" = "articulo_factura"."factura_id" inner join "articulos" on "articulos"."id" = "articulo_factura"."articulo_id" GROUP BY "facturas"."id"