tiendalaravel2324/routes/web.php

SELECT * FROM "articulos"
---
|
*/

Route::get('/', function () {
    return view('principal', [
        'articulos' => Articulo::all(),
    ]);
});